// Build Tools
// Бегуны задачи автоматически выполняют команды и выполняют процессы
// за кулисами.Это помогает автоматизировать ваш рабочий процесс, выполнив
// мирские, повторяющиеся задачи, которые вы в противном случае тратили вопиющие
// количество времени повторяя себя.
// распространенное использование бегунов задач включают в себя многочисленные задачи разработки, такие как
// as: вращение серверов разработки, компиляция кода (например, SCSS для CSS),
// запуск Linters, обслуживая файлы из локального порта на вашем компьютере,
// и многое другое!

// Посетите следующие ресурсы, чтобы узнать больше:

// Бесплатные ресурсы
// webpack это статический модуль для современных приложений JavaScript
// Vite Next Generation Frontend Tooling
// Parcel это нулевая инструмент сборки конфигурации для Интернета
// esbuild чрезвычайно быстрый JavaScript Bundler и Minifier
// swc супер-быстрый компилятор, написанный в Rust
// tsup является инструментом сборки типа
// Rollup Модуль Bundler для JavaScript
// tsdx CLI с нулевым конфигурацией для разработки пакета TypeScript
// feedExplore Лучшие сообщения об инструментах
