// Полезные пакеты
// TypeScript имеет большую экосистему пакетов, которые можно использовать для расширения языка или для добавления функциональности к вашему проекту.Вот список некоторых из самых полезных пакетов.
// @article@zod:Библиотека проверки данных в библиотеках
// @opensource@ts-morph: API-интерфейс-типовой первый для манипулирования кодом TypeScript
// @article@ts-node: A TypeScript исполнение и REPL for node.js
// @opensource@ts-jest: Трансформатор Jest с поддержкой карты источников, который позволяет использовать Jest для тестирования проектов, написанных в TypeScript.
// @opensource@typesync: Установите отсутствие TypeScript Типинг для зависимостей в вашем package.json.
// @opensource@tsd - TypeScript Определение менеджер
// @opensource@type-fest -Коллекция необходимых TypeScript типы
